'use strict';
// 1) Даны два массива: ['a', 'b', 'c'] и [1, 2, 3]. Объедините их вместе.

// const str = ['a', 'b', 'c'];
// const num = [1, 2, 3];
// const arr = str.concat(num);
// console.log(str);


// 2) Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.

// const arr = ['a', 'b', 'c'];
// arr.push(1, 2, 3);
// console.log(arr);

// 3) Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.

// const first = [1, 2, 3];
// const second = [4, 5, 6];
// const arr = first.concat(second);
// console.log(arr);


// 4) Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].

// const arr = [1, 2, 3];
// const rev = arr.reverse();
// console.log(rev);

// 5) Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.

// const arr = [1, 2, 3];
// arr.push(4, 5, 6);
// console.log(arr);

// 6) Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.

// const arr = [1, 2, 3];
// arr.unshift(4, 5, 6);
// console.log(arr);

// 7)  Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.

// const arr = ['js', 'css', 'jq'];
// console.log(arr[0]);


// :sunglasses: Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.

// const arr = ['js', 'css', 'jq'];
// console.log(arr[arr.length - 1]);

// 9) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].

// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.slice(0, 3);
// console.log(newArr);

// 10) Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [4, 5]. 

// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.slice(3);
// console.log(newArr);

// 11) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].

// const arr = [1, 2, 3, 4, 5];
// arr.splice(1,2);
// console.log(arr);

// 12)  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. 

// const arr = [1, 2, 3, 4, 5];
// const newArr = arr.splice(1, 3);
// console.log(newArr);

// 13) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. 

// const arr = [1, 2, 3, 4, 5];
// arr.splice(3, 0, 'a', 'b', 'c');
// console.log(arr);

// 14) Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. Показать решение. (edited)

// const arr = [1, 2, 3, 4, 5];
// arr.splice(1, 0, 'a', 'b');
// arr.splice(6, 0, 'c');
// arr.splice(8, 0, 'e');
// console.log(arr);



//=============================================================


// // 1) Вибираємо випадкове число (від 0 до довжини масива);

// const arr = [1, 3, 6, 4, 3, 4, 5, 9];
// const ran = Math.floor(Math.random() * arr.length);
// console.log(ran);

// // 2) Записати в змінну звернення типу масив[індекс];

// const arr = [1, 3, 6, 4, 3, 4, 5, 9];
// const test = arr[1];
// console.log(test);

// // 3) Вивести змінну з пунтку 2 в алерт;
// const animals = ['dog', 'cat', 'bird', 'fish'];
// let index = Math.floor(Math.random()*animals.length);
// alert(animals[index]);

// 1) Через prompt вводимо свій варіант тваринки
// 2) Варіант компютера записати в змінну
// 3) Порівнюємо наш варіант з копютерним
// 3,1) Якщо варіанти співпали тоді виводимо алертом що юзер виграва.
// 3,2) Якщо варіанти не співпали кажемо що користувач програв і виводимо варіант компютера.
// const comp = animals[index];
// const getAnimal = prompt('Enter your animal');
// if(getAnimal === comp) {
//     alert('You win!!!');
// } else {
//     alert('You lose!');
//     alert(comp);
// }

// Написати гру Камінь Ножиці Папір.
// Варіанти вибору потрібно зберігати в масиві
// Користувач вводить свій варіант
// Компютер вибирає свій рандомний варівант з масиву
// Первіряємо вибір користувача і вибір компютера. 
// Опрацювати всі варіанти:
// 1) Варіанти де виграє користувач
// 2) Варіанти де виграє компютер
// 3) Варіанти де виходить нічия.

// const choices = ['Камень', 'Ножници', 'Бумага'];
// const index = Math.floor(Math.random() * choices.length);

// const userChoice = prompt('Камень, Ножници, Бумага');
// const choice = choices[index];

// if(userChoice === choice) {
//     alert('Ничья');
// } else if(userChoice === 'Камень' && choice === 'Бумага' || userChoice === 'Бумага' && choice === 'Ножници' || userChoice === 'Ножници' && choice === 'Камень') {
//     alert('Вы проиграли!');
//     alert(choice);
// } else if(userChoice === 'Камень' && choice === 'Ножници' || userChoice === 'Бумага' && choice === 'Камень' || userChoice === 'Ножници' && choice === 'Бумага') {
//     alert('Вы победили!');
// } else {
//     alert('Неверный ввод');
// }


//========================================================================================================


// // 1) Записуємо в змінну строку з промта
// const str = prompt('Enter string');
// // 2) Зробити строку масивом
// const arr = str.split(' ');
// // 3) Скопіювати масив
// const newArr = arr.slice(0);
// // 4) Реверсимо масив
// const arrRev = newArr.reverse();
// // 5) З масивів робимо строки
// const secondStr = arrRev.join(' ');
// // 6) Порівнюємо дві строки і виводимо результат в консоль; 
// console.log(str);
// console.log(secondStr);



//====================================================================
// 1) Запитати логін
// 2) Перевірити чи існує логін в базі
// 3) Якщо логін існує вивести алерт ("Такий логін вже існує")
// 4) Якщо логін не існує вивести алерт ("Вітаємо")
// let logins = ['rew', 'qwewwe', 'apple', 'js', 'row', 'col'];
// const newLogin = prompt('Create new login');

// if(logins.includes(newLogin)) {
//     alert('Такий логін вже існує');
// } else {
//     alert('Вітаємо');
// }


//============================Day 02=======================================


//================ task 1 ===============


/*
 * Есть массив имен пользователей
 * Используя методы массива, последовательно выполнить указанные операции
 */

// const users = ["Mango", "Poly", "Ajax", "Chelsey"];

// // Удалить первый элемент массива
// users.shift();
// console.log(users); // ["Poly", "Ajax", "Chelsey"]

// // Удалить последний элемент массива
// users.pop();
// console.log(users); // ["Poly", "Ajax"]

// // Добавить в начало массива пользователя "Lux"
// users.unshift('Lux');
// console.log(users); // ["Lux", "Poly", "Ajax"]

// // Добавить в конец массива два пользователя ("Jay" и "Kiwi") за одну операцию
// users.push('Jay', 'Kiwi');
// console.log(users); //  ["Lux", "Poly", "Ajax", "Jay", "Kiwi"]

// // Удалить из массива элемент хранящийся в переменной userToDelete
// const userToDelete = "Ajax";
// users.splice(users.indexOf(userToDelete), 1);
// console.log(users); //  ["Lux", "Poly", "Jay", "Kiwi"]

// // Добавить в массив пользователя "Kong", перед пользователем хранящейся в переменной userToInsertBefore
// const userToInsertBefore = "Jay";
// users.splice(users.indexOf(userToInsertBefore), 0, 'Kong');
// console.log(users); //  ["Lux", "Poly", "Kong", "Jay", "Kiwi"]

//=============================task 2=======

//Задание 1 Вывести числа от 4 до 400 на экран.
// let a = 1;
// while (a < 401) {
//     console.log(a);
//     a++;
// }

//=============================task 3 ===============

//Задание 2 Вывести числа в последовательности: 4 7 10 13 с помощью цикла.

// for(let i = 4; i < 15; i++) {
//     if( i === 4 || i === 7 || i === 10 || i ===13) console.log(i);
// }

//=============================task 4 ===============

//Задание 3 Вывести числа 654 653 652 до нуля.

// for(let i = 700; i > 0; i--) {
//     if(i === 654 || i === 653 || i === 652) console.log(i);
// }

//=============================task 5 ===============

//Задание 4 Вывести все годы с 1983 до 2017.
// let year = 1983;
// do {
//     console.log(year + ' год');
//     year ++;
// } while (year <= 2017);

//============================== task 6 ===============

//Задание 8 Дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num

// let n = 1000;
// for(let num = 1; n >= 50; num++) {
//     n /= 2;
//     console.log(`${num}. ${n}`);
// }

//============================== task 7 =================================

// Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.
// const arr = [2, 5, 9, 15, 0, 4];
// for(let el of arr) {
//     if(el > 3 && el < 10) console.log(el);
// }

//==============================task 8 =================================

// Дан массив с числами. Числа могут быть положительными и отрицательными. Найдите сумму положительных элементов массива.

// const arr = [5, 7, -9, 1, 0, -4, 3];
// let result = null;
// for(let el of arr) {
//     if(el > 0) {
//         result += el;
//     }
// }
// console.log(result);
//=========================== tasks 9 =======================

// Дан массив с элементами 1, 2, 5, 9, 4, 13, 4, 10. С помощью цикла for и оператора if проверьте есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла. Если нет - ничего делать не надо.

// const arr = [1, 2, 5, 9, 4, 13, 4, 10];
// for(let el of arr) {
//     if( el === 4) {
//     console.log('Есть');
//     return;
//     }
// }

//============================ task 10 =====================

// Дан массив числами, например: ['10', '20', '30', '50', '235', '3000']. Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5. 

// const arr = ['10', '20', '30', '50', '235', '3000'];
// for (let el of arr) {
//     if (+el[0] === 1 || +el[0] === 2 || +el[0] === 5) console.log(el);
// }

//=========================== task 11 =========================

/*
* Есть массив имен пользователей users
*
* Напиши цикл, который для каждого пользователя будет выводить в консоль
* сообщение в формате [номер элемента] - [значение элемента]. 
* 
* Нумерация должна начинаться с 1. К примеру для первого элемента массива
* с индексом 0 будет выведено '1 - Mango', а для индекса 2 выведет '3 - Ajax'
*
* Цикл должен выводить сообщения до тех пор, пока не закончатся элементы массива
*/


// const users = ["Mango", "Poly", "Ajax", "Lux", "Jay", "Kong"];

// for(let i = 0, length = users.length; i < length; i++){
//     console.log(`${i+1}. ${users[i]}`);
// }

//=================OR=================================

// for(let el of users) {
//     console.log(`${users.indexOf(el) + 1}. ${el}`);
// }


//========================== task 12 =========================

/*
* Напиши скрипт по автоматизации оплаты процесса гравировки украшений.
* Гравировка одного слова стоит 10 кредитов.
*/

// В переменной message хранится произвольная строка
// const message = "Proin sociis natoque et magnis parturient montes mus";
// let price = 0;

// // // Разбить строку в массив, разделитель - пробел, и записать в переменную words
// const words = message.split(' ');
// console.log(words);

// // // Выведи в консоли длину массива words
// console.log(words.length); // 8

// // // Используя цикл вычисли сколько будет стоить гравировка и запиши результат в переменную price
// // console.log(price); // 80

// for(let el of words) {
//     price += 10;
// }
//===========================OR============================
// for(let i = 0, length = words.length; i < length; i++) {
//     price += 10;
// }
// console.log(price);

// //==============================OR============================

// for(let i = 0, length = words.length; i < length; i++) {
//     price += 10;
// }
// console.log(price);


//============================= task 13 ============================

/*
  Напиши цикл, который просит, через prompt, ввести число больше 100. 
  
  Если посетитель нажал Cancel - завершить цикл.
  
  Если посетитель ввёл другое число – попросить ввести ещё раз, 
  и так далее, пока не введет число больше 100.
  
  Предполагается, что посетитель вводит только числа, 
  обрабатывать невалидный ввод вроде строк 'qwerty' не нужно.
  
  PS: используй бесконечный цикл с прерыванием
*/
// let ask = null;
// do {
//     ask = prompt('Введите число больше 100');
// } while(ask !== null && ask < 101);


//============================= task 14 ===============================


 /*
  Напиши скрипт, который выбирает из массива numbers 
  все числа, которые больше чем значение переменной num, 
  записывая эти числа в массив matched.
      
  В результате в массиве matched будут все подходяшие числа.
      
  PS: используй цикл for или for...of и оператор ветвления if
*/

// const numbers = [1, 3, 17, 5, 9, 14, 8, 14, 34, 18, 26];
// const num = 10;
// const matched = [];

// // for(let el of numbers) {
// //     if(el > num) {
// //         matched.push(el);
// //     }
// // }

// //=================================OR=======================================

// for(let i = 0, length = numbers.length; i < length; i++) {
//     if(numbers[i] > num) {
//         matched.push(numbers[i]);
//     }
// }

// console.log(matched); // [17, 14, 14, 34, 18, 26]


//==================== task 15 ===============================================

/*
  Напиши скрипт, который проверяет произвольную строку 
  в переменной message и находит в ней самое длинное слово,
  записывая его в переменную longestWord.
*/

// const message = "May the force be with you";
// let longestWord ='';
// const arr = message.split(' ');

// for(let el of arr) {
//     if(el.length > longestWord.length) longestWord = el;
// }

// console.log(longestWord); // 'force'




//================== task 16 ===============================================


/*
  Создай игру угадай число.
  
  Есть массив чисел numbers, содержащий "верные" числа.
  Числа в массиве всегда идут по возрастанию, 1-5, 20-40, 2-100 и т.п.
  
  Просим пользователя ввести цифру от самого маленького,
  до самого большого элемента массива. Эти значения необходимо
  сохранить в переменные min и max. Учтите что массив произвольный,
  но элементы всегда идут по возрастанию.
  
  Пусть prompt говорит "Введите цифру между x и y", где x и y 
  соотвественно самый маленький и самый большой элемент массива.
  
  Предполагаем что пользователь вводит только числа, проверки на невалидный ввод не делать. 
  Проверить содержит ли в себе массив numbers введенное число.
  
    - Если содержит - выводим alert с сообщением 'Поздравляем, Вы угадали!'.
    - Есл не содержит - выводим alert с сообщением 'Сожалеем, Вы не угадали!'.
*/

// const numbers = [12, 15, 25, 37, 41, 62, 74, 83];
// const min = numbers[0];
// const max = numbers[numbers.length - 1];
// const ask = prompt(`Введите число от ${min} до ${max}`);

// if(ask !== null) {
//     if(numbers.includes(+ask)) {
//         alert('Поздравляем, Вы угадали!');
//     } else {
//         alert('Сожалеем, Вы не угадали!');
//     }
// }



//============================= task 17 ===================================

/*
  Напиши скрипт который:
  
  - Запрашивает по очереди числа при помощи prompt и сохраняет их в массиве.
    Используйте do...while.
  - Проверять что пользователь ввел не число не обязательно
  - Заканчивает запрашивать числа как только пользователь нажмёт Cancel.
  - После того как ввод был завершен, если массив не пустой, 
    скрипт выводит сумму всех значений массива: "Сумма: <сумма всех значений в массиве>"
    Используйте цикл for...of
*/
// let ask = null;
// const arr = [];
// let result = 0;

// do {
//     ask = prompt('Enter number');
//     const isNumber = !Number.isNaN(Number(ask));
//     if(ask !== null && isNumber) arr.push(+ask);
// } while(ask !== null);

// if(arr.length > 0){
//     for(let el of arr) result += el;
// }
// console.log(`Сумма: ${result}`);

//============================= ***ЗАДАНИЕ ПОВЫШЕННОЙ СЛОЖНОСТИ*** =============================

/*
  
  
  Создайте игру угадай число.
  
  Есть массив чисел numbers, содержащий "верные" числа.
  Числа в массиве всегда идут по возрастанию, 1-5, 20-40, 2-100 и т.п.
  
  Просим пользователя ввести цифру от самого маленького,
  до самого большого элемента массива. Эти значения необходимо
  сохранить в переменные min и max. Учтите что массив произвольный,
  но элементы всегда идут по возрастанию.
  
  Пусть prompt говорит "Введите цифру между x и y", где x и y 
  соотвественно самый маленький и самый большой элемент массива.
  
  Но пользователь может ввести что угодно, необходимо проверить 
  что было введено. Преобразовать input в числовой тип и проверить 
  число ли это.
  
    - Если не число - выводим alert с сообщением о том, что было 
      введено не число.
    - Если число - проверить содержит ли в себе массив numbers это число.
    - Если содержит - выводим alert с сообщением 'Поздравляем, Вы угадали!'.
    - Есл не содержит - выводим alert с сообщением 'Сожалеем, Вы не угадали!'.
*/

// const numbers = [12, 15, 25, 37, 41];
// const min = numbers[0];
// const max = numbers[numbers.length - 1];
// const ask = prompt(`Введите число от ${min} до ${max}`);

// if(ask !== null) {
//     const isNumber = !Number.isNaN(Number(ask));
//     if(isNumber) {
//         if(numbers.includes(+ask)){
//             alert('Поздравляем, Вы угадали!');
//         } else {
//             alert('Сожалеем, Вы не угадали!');
//         }
//     } else {
//         alert('It\'s not a number');
//     }
// }



//========================== ***ЗАДАНИЕ ПОВЫШЕННОЙ СЛОЖНОСТИ*** =====================

/*
  Написать следующий скрипт:
  
    - При загрузке страницы пользователю предлагается ввести через prompt число. 
      Число введенное пользователем записывается в массив чисел.
      
    - Операция ввода числа пользователем и сохранение в массив продолжается до
      тех пор, пока пользователь не нажмет Cancel в prompt. Используйте цикл do...while.
      
    - После того как пользователь прекратил ввод нажав Cancel, необходимо взять 
      массив введенных чисел, сложить общую сумму всех элементов массива и 
      записать ее в переменную. Используйте цикл for или for...of.
      
    - По окончанию ввода, если массив не пустой, вывести alert с текстом `Общая сумма чисел равна ${сумма}`
      
  🔔 PS: Делать проверку того, что пользователь ввел именно число, а не произвольный набор 
      символов, не обязательно. Если хотите, в случае некорректного ввода покажите alert с текстом 
      'Было введено не число, попробуйте еще раз', при этом результат prompt записывать 
      в массив чисел не нужно, после чего снова пользователю предлагается ввести число в prompt.
*/

// let userInput;
// const numbers = [];
// let total = 0;

// do {
//     userInput = prompt('Enter number');
//     const isNumber = !Number.isNaN(Number(userInput));
//     if(userInput !== null && isNumber) numbers.push(+userInput);
// } while(userInput !== null);

// if(numbers.length > 0){
//     for(let el of numbers) total += el;
// }
// console.log(`Сумма: ${total}`);


//========================== ***ЗАДАНИЕ ПОВЫШЕННОЙ СЛОЖНОСТИ*** =====================

/*
  
  Напишите скрипт имитирующий авторизацию пользователя.
  
  Есть массив паролей зарегистрированных пользователей passwords. 
  
  При посещении страницы, необходимо попросить пользователя ввести свой пароль,
  после чего проверить содержит ли массив passwords пароль введенный пользователем.
  
  Пароль можно ввести не верно всего n раз, кол-во хранится в переменной attempts.
  Подсказка: используйте цикл do...while.
  Если был введен пароль который есть в массиве passwords, вывести alert 
  с текстом 'Добро пожаловать!' и прекратить спрашивать пароль в цикле.
  Если был введен не существующий пароль, отнять от лимита попыток единицу, 
  вывести alert с текстом "Неверный пароль, у вас осталось n попыток", 
  где n это оставшийся лимит. 
  
  После того как пользователь закрыл alert, запросить пароль снова. 
  Продолжать запрашивать пароль до тех пор, пока пользователь не введет 
  существующий пароль, не кончатся попытки или пока пользователь 
  не нажмет Cancel в prompt.
  Если закончились попытки, вывести alert с текстом "У вас закончились попытки, аккаунт заблокирован!"
  
  Если пользователь нажмет Cancel, прекратить выполнение цикла.
*/

const passwords = ['qwerty', '111qwe', '123123', 'r4nd0mp4zzw0rd'];
let attempts = 3;
let ask = null;

do{
  ask = prompt('Введите пароль');
  if(passwords.includes(ask)) {
    alert('Добро пожаловать!');
    break;
  } else {
      attempts--;
      if(attempts === 0) {
        alert('У вас закончились попытки, аккаунт заблокирован!');
        break;
      }
      if(ask === null) break;
      alert(`Неверный пароль, у вас осталось ${attempts} попыток`);
  }

} while(ask !== null);